БПКР/src/Catalogs/ОсновныеСредства/ОсновныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеСредства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестонахождениеИмущества</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификационныйНомерИмущества</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>21</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпускаТранспортногоСредства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпускаНедвижимости</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/InformationRegisters/ПараметрыУчетаОС/ПараметрыУчетаОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыУчетаОС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаНУ</name>
    <type>
      <types>CatalogRef.ГруппыНалоговогоУчетаОС</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокСлужбы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходовПоАмортизации</name>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПоступления</name>
    <type>
      <types>EnumRef.СпособыПоступленияАктивов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляРасчетаАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачисленияНалогаНаИмущество</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Консервация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/МестонахождениеОС/МестонахождениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестонахождениеОС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛДо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеДо</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/ВидыСостоянийОС/ВидыСостоянийОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСостоянийОС</name>
  <enumValues>
    <name>Поступило</name>
  </enumValues>
  <enumValues>
    <name>ПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/ChartsOfCharacteristicTypes/ВидыСубконтоХозрасчетные/ВидыСубконтоХозрасчетные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконтоХозрасчетные</name>
  <type>
    <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    <types>CatalogRef.Номенклатура</types>
    <types>DocumentRef.ПоступлениеИзПереработки</types>
    <types>DocumentRef.КомплектацияНоменклатуры</types>
    <types>CatalogRef.ПодразделенияОрганизаций</types>
    <types>CatalogRef.Склады</types>
    <types>EnumRef.ВидыИзмененийВСобственномКапитале</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    <types>DocumentRef.ПеремещениеТоваров</types>
    <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
    <types>CatalogRef.Кассы</types>
    <types>CatalogRef.Контрагенты</types>
    <types>DocumentRef.АвансовыйОтчет</types>
    <types>CatalogRef.РасходыБудущихПериодов</types>
    <types>CatalogRef.НоменклатурныеГруппы</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.ВидыОплатОрганизаций</types>
    <types>CatalogRef.БанковскиеСчета</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>DocumentRef.ДвижениеМБП</types>
    <types>CatalogRef.Субконто</types>
    <types>DocumentRef.ОприходованиеТоваров</types>
    <types>CatalogRef.ОбъектыСтроительства</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>DocumentRef.ВводНачальныхОстатков</types>
    <types>DocumentRef.ЗаказНаПроизводство</types>
  </type>
  <predefined>
    <items>
      <name>удалитьВидыИзмененийВСобственномКапитале</name>
      <description>Виды изменений в собственном капитале</description>
      <code>000032</code>
      <type>
        <types>EnumRef.ВидыИзмененийВСобственномКапитале</types>
      </type>
    </items>
    <items>
      <name>ВидыОплат</name>
      <description>Виды оплат</description>
      <code>000034</code>
      <type>
        <types>CatalogRef.ВидыОплатОрганизаций</types>
      </type>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>000003</code>
      <type>
        <types>CatalogRef.Кассы</types>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000006</code>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000005</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Местонахождение</name>
      <description>Местонахождение</description>
      <code>000033</code>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>НоменклатурныеГруппы</name>
      <description>Номенклатурные группы</description>
      <code>000015</code>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </items>
    <items>
      <name>ОбъектыСтроительства</name>
      <description>Объекты строительства</description>
      <code>000016</code>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>ОсновныеСредства</name>
      <description>Основные средства</description>
      <code>000025</code>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </items>
    <items>
      <name>Партии</name>
      <description>Партии</description>
      <code>000023</code>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
        <types>DocumentRef.КомплектацияНоменклатуры</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ДвижениеМБП</types>
        <types>DocumentRef.ОприходованиеТоваров</types>
        <types>DocumentRef.ВводНачальныхОстатков</types>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </items>
    <items>
      <name>Подразделения</name>
      <description>Подразделения</description>
      <code>000013</code>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>000017</code>
      <type>
        <types>CatalogRef.РасходыБудущихПериодов</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000002</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>СотрудникиОрганизаций</name>
      <description>Сотрудники организации</description>
      <code>000008</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
      <code>000004</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>СтатьиЗатрат</name>
      <description>Статьи затрат и доходов</description>
      <code>000014</code>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

БПКР/src/Catalogs/ОсновныеСредства/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтерфейсПечати

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОсновныеСредства_КарточкаОС";
	ПервыйДокумент = Истина;
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 		
		              
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Если ИмяМакета = "КарточкаОС" Тогда
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ОсновныеСредства.КарточкаОС");
			
			ОбластьМакета = Макет.ПолучитьОбласть("Область");
			
			Ссылка = ТекущийДокумент.Ссылка;
			ДатаСведений  = ТекущаяДатаСеанса(); 	
			
			// Данные для заполнения закладки Бухгалтерский учет
			ВыборкаЗаписей = РегистрыСведений.ПараметрыУчетаОС.СрезПоследних(ДатаСведений,Новый Структура("ОсновноеСредство",Ссылка));

			ТекОрганизация = ?(ВыборкаЗаписей.Количество() > 0,ВыборкаЗаписей[0].Организация,0);   	
			
			Организация    = ТекОрганизация;  				
			
			// Последние сведения об ОС
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("Организация",      Организация);
			Запрос.УстановитьПараметр("ДатаСведений",     ДатаСведений);
			Запрос.УстановитьПараметр("ОсновноеСредство", Ссылка);
			Запрос.УстановитьПараметр("СубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетУчета КАК СчетУчета,
			|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СрокСлужбы КАК СрокСлужбы,
			|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Подразделение КАК Подразделение,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация КАК Организация,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство.Изготовитель КАК ИзготовительОС,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство.НомерПаспорта КАК ОсновноеСредствоНомерПаспорта,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство.ЗаводскойНомер КАК ОсновноеСредствоЗаводскойНомер,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство.ДатаВыпуска КАК ГодВыпуска,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
			|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ПервоначальнаяСтоимость - ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты_Амортизация.СуммаКонечныйОстатокКт, 0) КАК ОстаточнаяСтоимость,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Период КАК ДатаКапитализации,
			|	ПараметрыУчетаОССрезПервых.СрокСлужбы КАК ПервоначальныйСрокСлужбы,
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.СрокСлужбы - ПараметрыУчетаОССрезПервых.СрокСлужбы КАК СрокУвеличенияИспользования
			|ИЗ
			|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
			|			&ДатаСведений,
			|			Организация = &Организация
			|				И ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
			|				&ДатаСведений,
			|				Организация = &Организация
			|					И ОсновноеСредство = &ОсновноеСредство) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
			|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
			|				&ДатаСведений,
			|				Организация = &Организация
			|					И ОсновноеСредство = &ОсновноеСредство) КАК СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних
			|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.ОсновноеСредство
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(
			|				&ДатаСведений,
			|				Организация = &Организация
			|					И ОсновноеСредство = &ОсновноеСредство) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
			|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &ДатаСведений, , , , ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), ) КАК ХозрасчетныйОстаткиИОбороты_Амортизация
			|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ХозрасчетныйОстаткиИОбороты_Амортизация.Субконто1
			|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.СчетУчета.ПарныйСчет = ХозрасчетныйОстаткиИОбороты_Амортизация.Счет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОС.СрезПервых КАК ПараметрыУчетаОССрезПервых
			|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ПараметрыУчетаОССрезПервых.ОсновноеСредство
			|ГДЕ
			|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = &Организация";
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			
			// документы принятия к учету и выбытия ОС
			Запрос2 = Новый Запрос;
			Запрос2.Текст = 
			"ВЫБРАТЬ
			|	СостоянияОС.ОсновноеСредство,
			|	СостоянияОС.Состояние,
			|	СостоянияОС.Период КАК ДатаСостояния,
			|	СостоянияОС.Регистратор
			|ИЗ
			|	РегистрСведений.СостоянияОС КАК СостоянияОС
			|ГДЕ
			|	СостоянияОС.Организация = &Организация
			|	И СостоянияОС.ОсновноеСредство = &ОсновноеСредство";
			Запрос2.УстановитьПараметр("Организация", Организация);
			Запрос2.УстановитьПараметр("ОсновноеСредство", Ссылка);
			Запрос2.УстановитьПараметр("ДатаСведений", ДатаСведений);
			Выборка2 = Запрос2.Выполнить().Выбрать();
			
			// Основная область
			ТекущаяСтоимость =  0;
			СуммаНачисленнойАмортизации = 0;
			
			ОбластьМакета.Параметры.ПервоначальнаяСтоимость = Выборка.ПервоначальнаяСтоимость;
			
			Пока Выборка2.Следующий() Цикл
				Если Выборка2.Состояние   = Перечисления.ВидыСостоянийОС.ПринятоКУчету Тогда
					ОбластьМакета.Параметры.ДатаПриобретения = Формат(Выборка2.ДатаСостояния,"ДЛФ=D");//именно поступления
				ИначеЕсли Выборка2.Состояние   = Перечисления.ВидыСостоянийОС.СнятоСУчета Тогда
					ОбластьМакета.Параметры.ДатаВыбытия = Формат(Выборка2.ДатаСостояния,"ДЛФ=D");//именно выбытия
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакета.Параметры.ОсновноеСредство = Ссылка;
			ОбластьМакета.Параметры.Местонахождение = Выборка.Подразделение;
			//ОбластьМакета.Параметры.КодОрганизации = Выборка.Организация.Код;
			ОбластьМакета.Параметры.Организация = Выборка.Организация;
			ОбластьМакета.Параметры.БалансоваяСтоимость = Выборка.ПервоначальнаяСтоимость;
			ОбластьМакета.Параметры.ОстаточнаяСтоимость = Выборка.ОстаточнаяСтоимость;
			ОбластьМакета.Параметры.ДатаКапитализации 	= Формат(Выборка.ДатаКапитализации,"ДЛФ=D");
			ОбластьМакета.Параметры.ССПересмотрен 		= Выборка.СрокУвеличенияИспользования;
			ОбластьМакета.Параметры.СрокСлужбы 			= Выборка.СрокСлужбы;
			ОбластьМакета.Параметры.ПервоначальныйСрокСлужбы = Выборка.ПервоначальныйСрокСлужбы;
			
			ОбластьМакета.Параметры.Группа = ТекущийДокумент.Родитель;
			//ОбластьМакета.Параметры.МОЛ = Выборка.МОЛ;
			
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="сом,сома,сом,м,тыйын,тыйын,тыйын,м,2";
		
			ОбластьМакета.Параметры.ПСПрописью = ЧислоПрописью(?(ЗначениеЗаполнено(ОбластьМакета.Параметры.ПервоначальнаяСтоимость), ОбластьМакета.Параметры.ПервоначальнаяСтоимость, 0), ФормСтрока, ПарПредмета); 			                                   		
		
			ОбластьМакета.Параметры.ЗавНомерПредмета = ТекущийДокумент.ЗаводскойНомер;
			ОбластьМакета.Параметры.Примечание = ТекущийДокумент.Комментарий; 			
			
			ВыборкаЗаписей = РегистрыСведений.ПараметрыУчетаОС.ПолучитьПоследнее(ДатаСведений,Новый Структура("ОсновноеСредство",Ссылка));
			СрокСлужбы = ?(ВыборкаЗаписей.Количество() > 0, ВыборкаЗаписей.СрокСлужбы, 0);
				
			// для расчета накопленной стоимости амортиции
			ВидСубконтоОС = Новый Массив();
			ВидСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
			
			ВыборкаЗаписей = РегистрыСведений.ПараметрыУчетаОС.СрезПоследних(ДатаСведений,Новый Структура("ОсновноеСредство",Ссылка));
			ТекОрганизация = ?(ВыборкаЗаписей.Количество() > 0,ВыборкаЗаписей[0].Организация,Справочники.Организации.ПустаяСсылка());
			
			ВыборкаЗаписей = РегистрыСведений.ПараметрыУчетаОС.ПолучитьПоследнее(ДатаСведений,Новый Структура("ОсновноеСредство",Ссылка));
			СчетНачисленияАмортизации = ?(ВыборкаЗаписей.Количество() > 0, ВыборкаЗаписей.СчетУчета.ПарныйСчет,0);
			//считаем
			ВыборкаЗаписей = РегистрыБухгалтерии.Хозрасчетный.Остатки(ДатаСведений,ВидСубконтоОС,Новый Структура("Субконто1,Организация,Счет",Ссылка,ТекОрганизация,СчетНачисленияАмортизации));
			//выводим
			ОбластьМакета.Параметры.НакопленнаяАмортизация = ?(ВыборкаЗаписей.Количество() > 0,ВыборкаЗаписей[0].СуммаОстатокКт,0);
	
			ТабличныйДокумент.Вывести(ОбластьМакета); 			
			
		КонецЕсли;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	
	Если НЕ Ошибки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
КонецФункции // ПечатнаяФорма()

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КарточкаОС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"КарточкаОС",
		НСтр("ru = 'Карточка ОС'"),
		ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "КарточкаОС"));
	КонецЕсли;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КарточкаОС";
	КомандаПечати.Представление = НСтр("ru = 'Карточка ОС'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1; 
КонецПроцедуры

#КонецОбласти

#КонецЕсли
